Revit 2027 API
BuiltInFailures.WallFailures.InvalidBaseConstraintForLevel Property
 Base Constraint is invalid for the Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidBaseConstraintForLevel { get; }
Public Shared ReadOnly Property InvalidBaseConstraintForLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidBaseConstraintForLevel {
	FailureDefinitionId^ get ();
}
static member InvalidBaseConstraintForLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace